cmsis-svd/cmsis-svd/data/SiliconLabs/EFM32TG230F16.svd
        <register>
          <name>CMD</name>
          <description>GPIO Command Register</description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>EM4WUCLR</name>
              <description>EM4 Wake-up clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EM4WUEN</name>
          <description>EM4 Wake-up Enable Register</description>
          <addressOffset>0x134</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000003F</resetMask>
          <fields>
            <field>
              <name>EM4WUEN</name>
              <description>EM4 Wake-up enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A0</name>
                  <description>Enable em4 wakeup on pin A0</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A6</name>
                  <description>Enable em4 wakeup on pin A6</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C9</name>
                  <description>Enable em4 wakeup on pin C9</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>F1</name>
                  <description>Enable em4 wakeup on pin F1</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>F2</name>
                  <description>Enable em4 wakeup on pin F2</description>
                  <value>0x00000010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>E13</name>
                  <description>Enable em4 wakeup on pin E13</description>
                  <value>0x00000020</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EM4WUPOL</name>
          <description>EM4 Wake-up Polarity Register</description>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000003F</resetMask>
          <fields>
            <field>
              <name>EM4WUPOL</name>
              <description>EM4 Wake-up Polarity</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A0</name>
                  <description>Determines polarity on pin A0</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A6</name>
                  <description>Determines polarity on pin A6</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C9</name>
                  <description>Determines polarity on pin C9</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>F1</name>
                  <description>Determines polarity on pin F1</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>F2</name>
                  <description>Determines polarity on pin F2</description>
                  <value>0x00000010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>E13</name>
                  <description>Determines polarity on pin E13</description>
                  <value>0x00000020</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EM4WUCAUSE</name>
          <description>EM4 Wake-up Cause Register</description>
          <addressOffset>0x13C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000003F</resetMask>
          <fields>
            <field>
              <name>EM4WUCAUSE</name>
              <description>EM4 wake-up cause</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A0</name>
                  <description>This bit indicates an em4 wake-up request occurred on pin A0</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A6</name>
                  <description>This bit indicates an em4 wake-up request occurred on pin A6</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C9</name>
                  <description>This bit indicates an em4 wake-up request occurred on pin C9</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>F1</name>
                  <description>This bit indicates an em4 wake-up request occurred on pin F1</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>F2</name>
                  <description>This bit indicates an em4 wake-up request occurred on pin F2</description>
                  <value>0x00000010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>E13</name>
                  <description>This bit indicates an em4 wake-up request occurred on pin E13</description>
                  <value>0x00000020</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
